### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.web_apps_itn.azurerm_role_assignment.config_queue_op_func_itn["Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "config_queue_op_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c842ff1a-49c0-407d-9a76-210489abb536"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.config_queue_op_func_itn["Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "config_queue_op_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c842ff1a-49c0-407d-9a76-210489abb536"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "config_queue_op_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c842ff1a-49c0-407d-9a76-210489abb536"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app_itn["Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "storage_op_app_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ed8105a3-4bfe-4103-ac64-e36e86762d23"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app_itn["Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "storage_op_app_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ed8105a3-4bfe-4103-ac64-e36e86762d23"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app_slot_itn["Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "storage_op_app_slot_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "86905598-cf6c-4494-8ed7-aca76879bda9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_op_app_slot_itn["Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "storage_op_app_slot_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "86905598-cf6c-4494-8ed7-aca76879bda9"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_user_func_itn["Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "storage_user_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9dd4109-bac9-46d2-a596-8244801ba1b6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.storage_user_func_itn["Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "storage_user_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9dd4109-bac9-46d2-a596-8244801ba1b6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "storage_user_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9dd4109-bac9-46d2-a596-8244801ba1b6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.module.op_app.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-app-01"
        name                                           = "io-p-itn-fims-op-app-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.op_app.azurerm_linux_web_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-app-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.op_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps_itn.module.user_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-user-func-01"
        name                                           = "io-p-itn-fims-user-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.user_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-user-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 10 to add, 5 to change, 0 to destroy.
```

</details>
